In [13]:
import pandas as pd
import numpy as np
groceri = pd.Series(data=[1,2,"Yes",'No'],index=['eggs','tomato','milk','butter'])

In [6]:
groceries

eggs        1
tomato      2
milk      Yes
butter     No
dtype: object

In [14]:
groceries = pd.Series(data=np.array([1,2,"Yes",'No']),index=['eggs','tomato','milk','butter'])

In [16]:
groceries

eggs        1
tomato      2
milk      Yes
butter     No
dtype: object

In [26]:
a = pd.Series(np.random.randn(3),['a','b','c'])
a

a   -0.104463
b   -0.788751
c    0.796710
dtype: float64

In [27]:
a[a>a.mean()]

c    0.79671
dtype: float64

In [28]:
d = {'a':1,'b':2,'c':3}

In [30]:
b = pd.Series(d)
b

a    1
b    2
c    3
dtype: int64

In [44]:
d = {'b':2.,'c':3.,'a':1.}

In [45]:
c = pd.Series(d)
c

a    1.0
b    2.0
c    3.0
dtype: float64

In [42]:
e = {1:1,2:2,3:3}

a    True
b    True
c    True
dtype: bool

In [49]:
c[1:]

b    2.0
c    3.0
dtype: float64

In [50]:
c[:-1]

a    1.0
b    2.0
dtype: float64

In [51]:
c[1:]+c[:-1]

a    NaN
b    4.0
c    NaN
dtype: float64

In [53]:
(groceries+c).dropna()

Series([], dtype: object)

In [73]:
groceries

eggs        1
tomato      2
milk      Yes
butter     No
TUTU        3
dtype: object

In [54]:
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'd', 'c'])}
f = pd.DataFrame(d)

In [58]:
df = pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

In [59]:
f

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  4.0
d  NaN  3.0

In [60]:
df.index

Index(['d', 'b', 'a'], dtype='object')

In [64]:
df.columns

Index(['two', 'three'], dtype='object')

In [74]:
groceries['eggs']  = 3
groceries

eggs        3
tomato      2
milk      Yes
butter     No
TUTU        3
dtype: object

In [65]:
dir(df)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_SLICEMAP',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_only_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_apply_broadcast',
 '_apply_empty_result',
 '_apply_raw',
 '_apply_standard',
 '_at',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_percentile',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_const',
 '_combine_frame',
 '_combine_match_columns',
 '_combine_match_index',
 '_combine_series',
 '_combine_series_infer',
 '_compare_frame',
 '_compare_frame_evaluate',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_for_slice',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_ensure_valid_index',
 '_expand_axes',
 '_flex_compare_frame',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_numeric_data',
 '_get_valid_indices',
 '_get_value',
 '_get_values',
 '_getitem_array',
 '_getitem_column',
 '_getitem_frame',
 '_getitem_multilevel',
 '_getitem_slice',
 '_gotitem',
 '_iat',
 '_iget_item_cache',
 '_iloc',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_dict',
 '_init_mgr',
 '_init_ndarray',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_cython_func',
 '_is_datelike_mixed_type',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_loc',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_axis',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_shallow_copy',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_frame_compat',
 '_unpickle_matrix_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_matrix',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combine_first',
 'compound',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_items',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'three',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_panel',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'two',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

In [69]:
nx = np.array([('t',32,150.),('tu',33,152.),('mt',32,120.)],dtype=[('name','U10'),('age','i4'),('weight','f4')])
nx[0]

('t', 32,  150.)

In [71]:
pd.DataFrame(nx,index=['t','tu','mt'])

   name  age  weight
t     t   32   150.0
tu   tu   33   152.0
mt   mt   32   120.0

In [84]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
da2 = pd.DataFrame(data2,index=['one','two'])

In [85]:
da2

     a   b     c
one  1   2   NaN
two  5  10  20.0

In [74]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2}})

     a
     b
A B  1
  C  2

In [75]:
dic = {'a':{'b':'c'},'d':{'e':'f'}}
pd.DataFrame(dic)

     a    d
b    c  NaN
e  NaN    f

In [86]:
da2['d']  = da2['a'] +da2['b']
da2.pop('a')
da2

      b     c   d
one   2   NaN   3
two  10  20.0  15

In [88]:
da2.insert(0,'a',[1,2])

In [89]:
da2

     a   b     c   d
one  1   2   NaN   3
two  2  10  20.0  15

In [90]:
def fn(x):
    return x['a']/x['d']

In [91]:
da2.assign(e=fn)

     a   b     c   d         e
one  1   2   NaN   3  0.333333
two  2  10  20.0  15  0.133333

In [92]:
da2.assign(e=lambda x:x['a']/x['d'])

     a   b     c   d         e
one  1   2   NaN   3  0.333333
two  2  10  20.0  15  0.133333

In [95]:
da2.loc['one']

a    1.0
b    2.0
c    NaN
d    3.0
Name: one, dtype: float64

In [99]:
da2.iloc[1,1]

10

In [101]:
type(da2.iloc[1:])

pandas.core.frame.DataFrame

In [102]:
type(da2.iloc[1])

pandas.core.series.Series

In [107]:
da2[1:] == da2.iloc[1:]

        a     b     c     d
two  True  True  True  True

In [108]:
np.random.randn(4,7)

array([[ 1.76695579,  1.31924844, -0.59971035,  0.68858265,  0.69927651,
        -0.73098075,  1.04320585],
       [ 1.0567275 ,  1.00243334, -0.46701955,  0.71647956,  0.00963394,
         1.33235382,  0.4534091 ],
       [-0.19157557, -1.42930881, -1.16540368, -0.43578096,  0.13283571,
         1.29369158, -0.85524115],
       [ 1.11856314,  0.108357  , -0.98571413,  0.35761198,  0.08296833,
         1.1714949 , -0.87540625]])

In [113]:
da2.T.dot(da2)

      a      b   c      d
a   5.0   22.0 NaN   33.0
b  22.0  104.0 NaN  156.0
c   NaN    NaN NaN    NaN
d  33.0  156.0 NaN  234.0

In [114]:
da2

     a   b     c   d
one  1   2   NaN   3
two  2  10  20.0  15

In [115]:
da2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, one to two
Data columns (total 4 columns):
a    2 non-null int64
b    2 non-null int64
c    1 non-null float64
d    2 non-null int64
dtypes: float64(1), int64(3)
memory usage: 160.0+ bytes

In [119]:
da2.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [134]:
x = np.arange(4)
xx = x.reshape(4,1)
y = np.ones(5)
z = np.ones((3,4))
print(xx)
print(y)
xx+y

[[0]
 [1]
 [2]
 [3]]
[ 1.  1.  1.  1.  1.]

array([[ 1.,  1.,  1.,  1.,  1.],
       [ 2.,  2.,  2.,  2.,  2.],
       [ 3.,  3.,  3.,  3.,  3.],
       [ 4.,  4.,  4.,  4.,  4.]])

In [143]:
a = np.array([0.0, 10.0, 20.0, 30.0])
a.reshape(4,1)

array([[  0.],
       [ 10.],
       [ 20.],
       [ 30.]])

In [146]:
b=np.array([1,2,3,4])
a.reshape(4,1)*b

array([[   0.,    0.,    0.,    0.],
       [  10.,   20.,   30.,   40.],
       [  20.,   40.,   60.,   80.],
       [  30.,   60.,   90.,  120.]])

$$Bisic functionality$$

In [76]:
dict([('A', [1, 2, 3]), ('B', [4, 5, 6])])

{'A': [1, 2, 3], 'B': [4, 5, 6]}

In [120]:
da2

     a   b     c   d
one  1   2   NaN   3
two  2  10  20.0  15

In [130]:
da2.drop('one',axis=0)

     a   b     c   d
two  2  10  20.0  15

In [131]:
da2.sum(axis=0)

a     3.0
b    12.0
c    20.0
d    18.0
dtype: float64

In [129]:
da2.sum(axis=1)

one     6.0
two    47.0
dtype: float64

In [132]:
da2

     a   b     c   d
one  1   2   NaN   3
two  2  10  20.0  15

In [75]:
groceries.drop('eggs',inplace = True)
groceries

tomato      2
milk      Yes
butter     No
TUTU        3
dtype: object

In [147]:
ser = pd.Series(np.random.randn(100))

In [148]:
ser.head(6)

0   -0.419233
1   -2.378026
2   -1.238593
3    0.435211
4    0.061841
5   -0.872237
dtype: float64

In [154]:
df.columns=['a','b']
df.index

Index(['d', 'b', 'a'], dtype='object')

In [156]:
df
df['b'] = [1,2,3]

In [158]:
df['c'] = [4,5,6]
df.index=['one','two','three']

In [161]:
df

         a  b  c
one    3.0  1  4
two    2.0  2  5
three  1.0  3  6

In [167]:
(df>=2).all(axis=0)

a    False
b    False
c     True
dtype: bool

In [171]:
arr = np.random.randn(8)
print(arr)
p = pd.cut(arr,4)
p

[ 0.75595695  1.27797134  2.26521378 -0.59584949 -0.29707283  0.95764568
 -0.2936      1.28889384]

[(0.119, 0.835], (0.835, 1.55], (1.55, 2.265], (-0.599, 0.119], (-0.599, 0.119], (0.835, 1.55], (-0.599, 0.119], (0.835, 1.55]]
Categories (4, interval[float64]): [(-0.599, 0.119] < (0.119, 0.835] < (0.835, 1.55] < (1.55, 2.265]]

In [172]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [179]:
df.apply(subtract_and_divide,args=(2,2))

         a    b    c
one    0.5 -0.5  1.0
two    0.0  0.0  1.5
three -0.5  0.5  2.0

In [177]:
df

         a  b  c
one    3.0  1  4
two    2.0  2  5
three  1.0  3  6

In [180]:
tsdf = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],index=pd.date_range('1/1/2000', periods=10))

In [183]:
tsdf

                   A         B         C
2000-01-01 -0.697172 -1.607952 -2.463080
2000-01-02 -0.331190 -1.094282 -0.750183
2000-01-03  0.463573 -0.035207  0.786007
2000-01-04 -0.591350  0.208392  0.829813
2000-01-05  1.533418  0.217475  0.813125
2000-01-06  1.012300  0.818504  0.054778
2000-01-07  0.146117  0.727021 -0.463365
2000-01-08  1.060989  0.973087 -0.072522
2000-01-09  1.202007  1.792198 -0.607850
2000-01-10 -0.924078 -1.307026  0.611637

In [182]:
tsdf.agg(np.sum)

A    2.874614
B    0.692211
C   -1.261639
dtype: float64

In [185]:
tsdf.A.agg('sum')

2.874614341329631

In [190]:
df4 = pd.DataFrame([['aaaa','bb'],['ceeed','dffffff']],index=['one','two'],columns=['aa','bb'])

In [191]:
f = lambda x:len(str(x))
df4['aa'].map(f)

one    4
two    5
Name: aa, dtype: int64

In [193]:
df4.applymap(f)

     aa  bb
one   4   2
two   5   7

In [194]:
s = pd.Series(['six','severn','six','severn'],index=['a','b','c','d'])
t = pd.Series([6,7],index=['six','severn'])
print(s,t)
s.map(t)

a       six
b    severn
c       six
d    severn
dtype: object six       6
severn    7
dtype: int64

a    6
b    7
c    6
d    7
dtype: int64

In [201]:
df4

        aa       bb
two   aaaa       bb
one  ceeed  dffffff

In [204]:
df4.index=['one','two']

In [205]:
df4

        aa       bb
one   aaaa       bb
two  ceeed  dffffff

In [208]:
df4.reindex(index=['two','one'])

        aa       bb
two  ceeed  dffffff
one   aaaa       bb

In [209]:
df4

        aa       bb
one   aaaa       bb
two  ceeed  dffffff

In [210]:
df5 = pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'],index=['one','two','three'])

In [211]:
df6 = pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'],index=['three','two','one'])

In [212]:
df5

              a         b         c         d
one    1.175378 -0.788867  1.142768 -0.246072
two   -1.211822  0.303453  0.031464  1.269194
three  0.003726 -0.620267  0.404228 -0.461123

In [213]:
df6

              a         b         c         d
three  0.356965 -1.131993  0.472853 -1.826821
two   -0.206705  1.025919  0.575164 -0.145040
one   -0.232218 -0.335702  0.870188  0.342276

In [214]:
df6.reindex_like(df5)

              a         b         c         d
one   -0.232218 -0.335702  0.870188  0.342276
two   -0.206705  1.025919  0.575164 -0.145040
three  0.356965 -1.131993  0.472853 -1.826821

In [234]:
df6

              a         b         c         d
three  0.356965 -1.131993  0.472853 -1.826821
two   -0.206705  1.025919  0.575164 -0.145040
one   -0.232218 -0.335702  0.870188  0.342276

In [237]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, three to one
Data columns (total 4 columns):
a    3 non-null float64
b    3 non-null float64
c    3 non-null float64
d    3 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [239]:
df6.rename({'three':'3','two':'2','one':'1'},axis=0)

          a         b         c         d
3  0.356965 -1.131993  0.472853 -1.826821
2 -0.206705  1.025919  0.575164 -0.145040
1 -0.232218 -0.335702  0.870188  0.342276

In [240]:
df6

              a         b         c         d
three  0.356965 -1.131993  0.472853 -1.826821
two   -0.206705  1.025919  0.575164 -0.145040
one   -0.232218 -0.335702  0.870188  0.342276

In [236]:
df6.mode(axis=0)

          a         b         c         d
0 -0.232218 -1.131993  0.472853 -1.826821
1 -0.206705 -0.335702  0.575164 -0.145040
2  0.356965  1.025919  0.870188  0.342276

In [224]:
for name,col in df6.iteritems():
    print(name)
    print(col)

a
three    0.356965
two     -0.206705
one     -0.232218
Name: a, dtype: float64
b
three   -1.131993
two      1.025919
one     -0.335702
Name: b, dtype: float64
c
three    0.472853
two      0.575164
one      0.870188
Name: c, dtype: float64
d
three   -1.826821
two     -0.145040
one      0.342276
Name: d, dtype: float64

In [215]:
df6.align(df5,join='inner')

(              a         b         c         d
 three  0.356965 -1.131993  0.472853 -1.826821
 two   -0.206705  1.025919  0.575164 -0.145040
 one   -0.232218 -0.335702  0.870188  0.342276,
               a         b         c         d
 three  0.003726 -0.620267  0.404228 -0.461123
 two   -1.211822  0.303453  0.031464  1.269194
 one    1.175378 -0.788867  1.142768 -0.246072)

In [216]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s1 = s[:4]
s2 = s[1:]
s1

a   -2.289670
b    1.344180
c    0.205427
d    1.148270
dtype: float64

In [217]:
s2

b    1.344180
c    0.205427
d    1.148270
e    2.933659
dtype: float64

In [220]:
s2.rename({'b':'bee'})

bee    1.344180
c      0.205427
d      1.148270
e      2.933659
dtype: float64

In [221]:
s2.rename('tutu')

b    1.344180
c    0.205427
d    1.148270
e    2.933659
Name: tutu, dtype: float64

In [222]:
for a in s2:
    print(a)

1.344179583434981
0.20542672811544088
1.1482704097139451
2.933658769109078

In [223]:
for b in df6:
    print(b)

a
b
c
d

In [231]:
from collections import namedtuple
nt = namedtuple('tutu','x y')
n1 = nt(1,2)
n1.x

1

In [245]:
df7 = pd.Series(pd.date_range('20130101 09:10:12',periods=10))

In [246]:
df7

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
4   2013-01-05 09:10:12
5   2013-01-06 09:10:12
6   2013-01-07 09:10:12
7   2013-01-08 09:10:12
8   2013-01-09 09:10:12
9   2013-01-10 09:10:12
dtype: datetime64[ns]

In [247]:
df7.dt.weekday

0    1
1    2
2    3
3    4
4    5
5    6
6    0
7    1
8    2
9    3
dtype: int64

In [249]:
df7[df7.dt.weekday==2]

1   2013-01-02 09:10:12
8   2013-01-09 09:10:12
dtype: datetime64[ns]

In [252]:
s1 = pd.Series(np.random.randn(15))
s1[2:5]=np.nan

In [253]:
s1

0    -0.013476
1     1.147843
2          NaN
3          NaN
4          NaN
5    -0.287972
6    -1.505737
7    -0.327882
8    -0.157121
9    -1.035795
10    0.329331
11   -0.232199
12    0.763678
13   -0.597806
14    0.933935
dtype: float64

In [259]:
s1.sort_values(na_position='first',ascending=False)

2          NaN
3          NaN
4          NaN
1     1.147843
14    0.933935
12    0.763678
10    0.329331
0    -0.013476
8    -0.157121
11   -0.232199
5    -0.287972
7    -0.327882
13   -0.597806
9    -1.035795
6    -1.505737
dtype: float64

In [262]:
tf = df7
df6.sort_values(by=['a','c'])

              a         b         c         d
one   -0.232218 -0.335702  0.870188  0.342276
two   -0.206705  1.025919  0.575164 -0.145040
three  0.356965 -1.131993  0.472853 -1.826821

In [269]:
(df6>0).select_dtypes(include=[bool])

           a      b     c      d
three   True  False  True  False
two    False   True  True  False
one    False  False  True   True

In [267]:
s[s>0]

b    1.344180
c    0.205427
d    1.148270
e    2.933659
dtype: float64

In [270]:
s2 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [272]:
s2.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [275]:
st1 = pd.Series(['a_b_c','d_e_f','h_g_i'])

In [277]:
st1.str.split('_',expand=True)

   0  1  2
0  a  b  c
1  d  e  f
2  h  g  i

In [278]:
st1.str.split('_',expand=True,n=1)

   0    1
0  a  b_c
1  d  e_f
2  h  g_i

In [280]:
st1.str.cat()

'a_b_cd_e_fh_g_i'

In [282]:
st1[3]=np.nan

In [283]:
st1

0    a_b_c
1    d_e_f
2    h_g_i
3      NaN
dtype: object